fireFoam/testBatteryFireFOAM/wallFireSpread2D/0/panelRegion/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.com               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    panel_top
    {
        type            zeroGradient;
    }

    panel_side
    {
        type            empty;
    }

    region0_to_panelRegion_panel
    {
        type            directMappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_panelRegion_panel;
        offset          (0 0 0);
        fieldName       Qr;
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
