fireFoam/testBatteryFireFOAM/wallFireSpread2D/0/panelRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    panel_top
    {
        type            zeroGradient;
    }

    panel_side
    {
	type empty;
    }

    region0_to_panelRegion_panel
    {
        //type          compressible::turbulentTemperatureCoupledBaffleMixed;
        type          compressible::turbulentTemperatureRadiationCoupledMixed;
        //type          compressible::turbulentTemperatureRadiationCoupledMixedST;
        neighbourFieldName T;
        K               K;
        neighbourFieldRadiativeName Qr;
        fieldRadiativeName none;
        value           uniform 293;
    }

}


// ************************************************************************* //
