fireFoam/testBatteryFireFOAM/wallFireSpread2D/constant/panelRegion/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidChemistryModel  ODESolidChemistryModel<constSolidThermoPhysics>;

gasThermoModel  gasThermoPhysics;

chemistry           on;

chemistrySolver     odeNew;

initialChemicalTimeStep 1e-07;

odeNewCoeffs
{
    ODESolver       SIBS;
    eps             0.05;
}

species
(
    gas 
);

reactions    //properties of single-wall corrugated
(
    irreversibleSolidArrheniusReaction
    v  = gas + char
    (7.83e10 15274.57 400 4.86)
);

gas gas 1   18.0153
    200 5000    1000
    2.67215 0.00305629 -8.73026e-07 1.201e-10 -6.39162e-15 -29899.2 6.86282
    3.38684 0.00347498 -6.3547e-06 6.96858e-09 -2.50659e-12 -30208.1 2.59023
    1.67212e-06 170.672;


// ************************************************************************* //
